local BaseRoomAreaConfig = {}

BaseRoomAreaConfig.Values = {
	[1001] = {1001,[[地板區域]],2,"1020","0","102","0",0,},
	[1002] = {1002,[[地毯區域]],1,"1008","6,6","205","0",0,},
	[1003] = {1003,[[家具區域]],0,"1015;1010;1012;1016;1013;1011;1016;1014;1031","7,8;0,5;0,1;0,15;12,0;0,12;15,0;5,0;8,11","200;201;202;203;204","1;0;0;0;1;0;1;1;0",0,},
	[1004] = {1004,[[牆面區域]],5,"1019","0","101","0",0,},
	[1005] = {1005,[[牆掛飾左區域]],3,"1017","1,5","206","0",0,},
	[1006] = {1006,[[牆掛飾右區域]],3,"1018","1,4","206","0",0,},
	[1007] = {1007,[[壁紙左區域]],4,'','',"103",'',0,},
	[1008] = {1008,[[壁紙右區域]],4,'','',"103",'',0,},
	[1009] = {1009,[[空地板區域]],2,'','',"102",'',0,},
	[2001] = {2001,[[地板區域]],2,"2001002","0","300","0",0,},
	[2002] = {2002,[[地毯區域]],1,'','',"300",'',0,},
	[2003] = {2003,[[家具區域]],0,"2001101;2001201;2001301;2001401","8,4;6,0;0,0;0,9","300","0;0;0;0",0,},
	[2004] = {2004,[[牆面區域]],5,"2001001","0","300","0",0,},
	[2005] = {2005,[[牆掛飾區域]],3,'','',"206",'',0,},
	[2006] = {2006,[[牆掛飾右區域]],3,'','',"206",'',0,},
	[2007] = {2007,[[壁紙左區域]],4,'','',"103",'',0,},
	[2008] = {2008,[[壁紙右區域]],4,'','',"103",'',0,},
}

function BaseRoomAreaConfig.GetConfig(key)
	local tb = BaseRoomAreaConfig.Values[key]
	if not tb then
		print_error(string.format("key type is %s,key = %s",type(key),key))
		return nil
	end
	local config = {["id"] = 1,["areaname"] = 2,["areatype"] = 3,["initialfurniture"] = 4,["initialfurniturepos"] = 5,["furnituretype"] = 6,["furniturerotate"] = 7,["nazo"] = 8,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return BaseRoomAreaConfig