local CommodityTypeConfig = {}

CommodityTypeConfig.Values = {
	[1] = {1,[[原石切割]],0,"0","0","0","0",3,"trading_1_icon_102",'','','','',0,0,0,},
	[2] = {2,[[蜃海禮裝]],0,"1577808000","0","0","0",5,"trading_1_icon_105",'','','','',0,0,0,},
	[3] = {3,[[資源補給]],0,"0","0","0","0",4,"trading_1_icon_103",'','','','',0,0,0,},
	[4] = {4,[[供給箱]],0,"0","0","0","0",1,"trading_1_icon_104",'','','','',0,0,0,},
	[5] = {5,[[黑市]],0,"0","0","1,4","4;1,100",2,"trading_1_icon_101",'','','','',0,0,0,},
	[6] = {6,[[基地工程]],0,"0","0","0","0",6,"trading_1_icon_106",'','','','',0,0,0,},
	[15] = {15,[[神秘商城]],12,"0","0","0","0",0,"trading_1_icon_106",'','','','',0,0,0,},
	[8] = {8,[[大漁祭商城]],21,"0","0","0","0",0,"trading_1_icon_107","12,13",{"2,60250,1"},"map_1_head_tittle_fs","activity_shop_text_02",0,0,0,},
	[9] = {9,[[大漁祭商城]],22,"0","0","0","0",0,"trading_1_icon_107","12,13",{"2,60250,1"},"map_1_head_tittle_fs","activity_shop_text_02",0,0,0,},
	[11] = {11,[[月卡]],0,"0","0","0","0",0,"trading_1_icon_106",'','','','',0,0,0,},
	[12] = {12,[[鑽石兌換]],0,"0","0","0","0",1,"trading_1_icon_104",'','','','',0,0,0,},
	[107] = {107,[[神秘商城]],1012,"0","0","0","0",0,"trading_1_icon_106",'','','','',0,0,0,},
	[13] = {13,[[家具商城]],0,"0","0","0","0",0,'','','','','',0,0,0,},
	[9000] = {9000,[[演習商城]],0,"0","0","5","31",0,'',"14",{"5,3013000,1"},"exercise_1_head_tittle_shop","pvp_shop_tips1",0,9000,0,},
	[14] = {14,[[回收商城]],0,"0","0","3","0",0,'',"16",{"5,1029900,1"},"recycle_1_head_tittle","retire_shop_time",1,14,0,},
	[21] = {21,[[高級回收商城]],0,"0","0","3","0",0,'',"27",{"5,1029900,1"},"recycle_1_head_tittle","retire_shop_time",1,14,0,},
	[22] = {22,[[優選物資]],0,"0","0","0","0",3,"trading_1_icon_104",'','','','',0,0,0,},
	[23] = {23,[[定額援助]],0,"1577808000","1577808001","0","0",2,"trading_1_icon_104",'','','','',0,0,0,},
	[24] = {24,[[超值供給]],0,"1577808000","1577808001","0","0",4,"trading_1_icon_104",'','','','',0,0,0,},
	[25] = {25,[[每日供給]],0,"1577808000","1577808001","0","0",1,"trading_1_icon_104",'','','','',0,0,0,},
	[26] = {26,[[黑石商店]],60,"0","0","0","0",1,"trading_1_icon_106","33",'','','',0,0,0,},
	[17] = {17,[[核心商店α]],33,"0","0","0","0",0,"trading_1_icon_107","20,21",{"2,30191,1"},"map_1_head_tittle_recallshaft","activity_shop_text_02",1,0,0,},
	[16] = {16,[[核心商店β]],34,"0","0","0","0",0,"trading_1_icon_107","20,21",{"2,30191,1"},"map_1_head_tittle_recallshaft","activity_shop_text_02",1,0,0,},
	[18] = {18,[[資料回收α]],36,"0","0","0","0",0,"trading_1_icon_107","22,23",{"5,3009900,1"},"map_1_head_tittle_virtual","activity_shop_text_02",1,0,0,},
	[19] = {19,[[資料回收β]],37,"0","0","0","0",0,"trading_1_icon_107","22,23",{"5,3009900,1"},"map_1_head_tittle_virtual","activity_shop_text_02",1,0,0,},
	[20] = {20,[[資料回收γ]],38,"0","0","0","0",0,"trading_1_icon_107","22,23",{"5,3009900,1"},"map_1_head_tittle_virtual","activity_shop_text_02",1,0,0,},
	[9998] = {9998,[[道具商店]],0,"0","0","0","0",0,"trading_1_icon_107","17,1",{"5,1029900,1"},"exlporation_head_tittle",'',1,0,0,},
	[9999] = {9999,[[獎勵商店]],0,"0","0","0","0",0,"trading_1_icon_107","18",{"5,1029900,1"},"exlporation_head_tittle",'',1,0,0,},
	[100] = {100,[[礦脈挖掘潛盾機]],31,"0","0","0","0",0,'','','','','',0,0,0,},
	[101] = {101,[[慾念商城]],51,"0","0","0","0",0,"trading_1_icon_107","29",{"5,920001,1"},"monopoly_1_head_tittle","activity_shop_text_02",0,0,0,},
}

function CommodityTypeConfig.GetConfig(key)
	local tb = CommodityTypeConfig.Values[key]
	if not tb then
		print_error(key)
		return nil
	end
	local config = {["id"] = 1,["name"] = 2,["activity"] = 3,["starttime"] = 4,["endtime"] = 5,["renovate"] = 6,["manual"] = 7,["sort"] = 8,["icon"] = 9,["commodity_coin"] = 10,["boat_painting"] = 11,["title"] = 12,["timetxt"] = 13,["diff"] = 14,["groupid"] = 15,["nazo"] = 16,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return CommodityTypeConfig