local FettersConfig = {}

FettersConfig.Values = {
	[1] = {1,[[八百萬神]],[[3個神代會社人偶]],[[我方所有人偶防護力增加{0}%]],[[5個神代會社人偶]],[[我方所有人偶防護力增加{0}%]],'','',"fetters_icon_01","2,3,2","3,5","28,2,75;3,2,75|28,2,150;3,2,150",1,"1000,1500",[[神代會社中，訓練有素的人偶們會被稱作「八百萬神」，而她們也是國土防禦最重要的力量。]],0,1,1,0,},
	[2] = {2,[[自由之翼]],[[3個銀翼財團人偶]],[[我方所有人偶防護力增加{0}%]],[[5個銀翼財團人偶]],[[我方所有人偶防護力增加{0}%]],'','',"fetters_icon_03","2,4,2","3,5","28,2,75;3,2,75|28,2,150;3,2,150",1,"1000,1500",[[銀色雙翼所照耀的光輝，就是銀翼財團的人偶們前進的動力。]],0,1,1,0,},
	[3] = {3,[[鋼鐵雄心]],[[3個黑鋒重工人偶]],[[我方所有人偶防護力增加{0}%]],[[5個黑鋒重工人偶]],[[我方所有人偶防護力增加{0}%]],'','',"fetters_icon_02","2,1,2","3,5","28,2,75;3,2,75|28,2,150;3,2,150",1,"1000,1500",[[鐵一般的紀律造就了鐵一般的部隊，黑鋒重工正是靠著這人偶鐵騎，縱橫海上。]],0,1,1,0,},
	[4] = {4,[[不落榮光]],[[3個薔薇帝國人偶]],[[我方所有人偶防護力增加{0}%]],[[5個薔薇帝國人偶]],[[我方所有人偶防護力增加{0}%]],'','',"fetters_icon_04","2,2,2","3,5","28,2,75;3,2,75|28,2,150;3,2,150",1,"1000,1500",[[優雅，精準，薔薇的人偶們一直被如此教導，只要她們還在，薔薇帝國就還是那個日不落帝國。]],0,1,1,0,},
	[5] = {5,[[群狼撕咬]],[[2個驅逐艦]],[[我方所有驅逐艦雷擊增加{0}%、砲擊增加{1}%]],[[3個驅逐艦]],[[我方所有驅逐艦雷擊增加{0}%、砲擊增加{1}%]],[[4個驅逐艦]],[[我方所有驅逐艦雷擊增加{0}%、砲擊增加{1}%]],"fetters_icon_05","1,5,1","2,3,4","2,2,25;4,2,25|2,2,50;4,2,35|2,2,75;4,2,50",1,"500,1000,1500",[[除了防空和反潛，驅逐人偶也有其他能做到的事情，如果在海面上遇到了驅逐人偶群，你可要小心了！]],0,1,0,0,},
	[6] = {6,[[火力援護]],[[2個輕巡洋艦]],[[我方所有輕巡洋艦砲擊增加{0}%、火控增加{1}%]],[[3個輕巡洋艦]],[[我方所有輕巡洋艦砲擊增加{0}%、火控增加{1}%]],[[4個輕巡洋艦]],[[我方所有輕巡洋艦砲擊增加{0}%、火控增加{1}%]],"fetters_icon_06","1,3,1","2,3,4","2,2,25;36,2,25|2,2,35;36,2,75|2,2,50;36,2,125",1,"500,1000,1500",[[將自己的能力發揮到極致，便是輕巡洋艦人偶們的目標。]],0,1,0,0,},
	[7] = {7,[[鐵壁護衛]],[[2個重巡洋艦]],[[我方所有重巡洋艦機動增加{0}%、損管增加{1}%]],[[3個重巡洋艦]],[[我方所有重巡洋艦機動增加{0}%、損管增加{1}%]],[[4個重巡洋艦]],[[我方所有重巡洋艦機動增加{0}%、損管增加{1}%]],"fetters_icon_07","1,4,1","2,3,4","8,2,5;35,2,50|8,2,15;35,2,75|8,2,25;35,2,100",1,"500,1000,1500",[[即使作為船艦時的歷史並不是這樣，現在重巡洋艦人偶們已經習慣被定為戰術的前排了。]],0,1,0,0,},
	[8] = {8,[[重裝打擊]],[[2個戰艦]],[[我方所有戰艦砲擊增加{0}%、暴擊增加{1}%]],[[3個戰艦]],[[我方所有戰艦砲擊增加{0}%、暴擊增加{1}%]],[[4個戰艦]],[[我方所有戰艦砲擊增加{0}%、暴擊增加{1}%]],"fetters_icon_08","1,6,1","2,3,4","2,2,25;9,2,5|2,2,50;9,2,15|2,2,75;9,2,25",1,"500,1000,1500",[[大艦，巨砲，作為戰艦人偶的她們無疑對自己的火力有著充足的自信。]],0,1,0,0,},
	[9] = {9,[[空域支配]],[[2個航空母艦]],[[我方所有航空母艦空襲增加{0}%、暴擊增加{1}%]],[[3個航空母艦]],[[我方所有航空母艦空襲增加{0}%、暴擊增加{1}%]],[[4個航空母艦]],[[我方所有航空母艦空襲增加{0}%、暴擊增加{1}%]],"fetters_icon_09","1,1,1","2,3,4","5,2,25;9,2,5|5,2,50;9,2,15|5,2,75;9,2,25",1,"500,1000,1500",[[曾經作為新時代的寵兒，航母型人偶的出現也讓現在的海上出現了更多的變數，不過可以知道的是，她們和戰艦人偶們的關係似乎並不好。]],0,1,0,0,},
	[10] = {10,[[陽炎烈火]],[[2個陽炎烈火人偶]],[[我方陽炎級驅逐艦砲擊增加{0}%、機動增加{1}%]],[[4個陽炎烈火人偶]],[[我方陽炎級驅逐艦砲擊增加{0}%、機動增加{1}%]],'','',"fetters_icon_10","4,10,1","2,4","2,2,15;8,2,5|2,2,30;8,2,15",1,"1000,1500",[[同為陽炎級驅逐艦的兄弟姐妹們，擁有著刻在骨髓裡的血脈羈絆，讓陽炎烈火燒盡敵人的心臟吧！]],0,1,0,0,},
	[11] = {11,[[閃耀舞臺]],[[2個閃耀舞臺人偶]],[[我方閃耀舞臺人偶砲擊增加{0}%]],[[4個閃耀舞臺人偶]],[[我方閃耀舞臺人偶砲擊增加{0}%]],[[5個閃耀舞臺人偶]],[[我方閃耀舞臺人偶砲擊增加{0}%]],"fetters_icon_11","4,11,1","2,4,5","2,2,25;28,2,25|2,2,50;28,2,50|2,2,75;28,2,75",1,"500,1000,1500",[[作為偶像出道的妙高四姐妹，在最後同意了夕張的加入，這對偶像組合究竟會有怎樣的發展，就讓我們拭目以待吧~]],0,1,0,0,},
	[12] = {12,[[末日重巡]],[[3個末日重巡人偶]],[[我方末日重巡人偶防護力增加{0}%]],'','','','',"fetters_icon_12","4,12,1","3","28,2,100;3,2,100",1,"1000",[[身為黑鋒重工的希佩爾級重巡型人偶，她們自然也要擔當起自己的職責。]],0,1,0,0,},
	[13] = {13,[[二羽鶴]],[[2個二羽鶴人偶]],[[我方二羽鶴人偶空襲增加{0}%]],'','','','',"fetters_icon_13","4,13,1","2","5,2,100",1,"1000",[[作為姐妹一起戰鬥至今的翔鶴瑞鶴，已經是互相生命中的一部分，沒有什麼困難能將她們分開。]],0,1,0,0,},
	[14] = {14,[[巨獸狩獵]],[[2個巨獸狩獵人偶]],[[我方巨獸狩獵人偶砲擊、空襲增加{0}%]],[[4個巨獸狩獵人偶]],[[我方巨獸狩獵人偶砲擊、空襲增加{0}%]],'','',"fetters_icon_17","4,14,1","2,4","2,2,25;5,2,25|2,2,50;5,2,50",1,"1000,1500",[[在迷霧中，一頭受傷的巨獸正在咆哮，追擊牠的獵人們也已經集結完畢……]],0,1,0,0,},
	[15] = {15,[[迷霧重重]],[[2個迷霧重重人偶]],[[我方迷霧重重人偶防空增加{0}%、火控增加{1}%]],[[4個迷霧重重人偶]],[[我方迷霧重重人偶防空增加{0}%、火控增加{1}%]],[[5個迷霧重重人偶]],[[我方迷霧重重人偶防空增加{0}%、火控增加{1}%]],"fetters_icon_14","4,15,1","2,4,5","3,2,10;36,2,10|3,2,25;36,2,25|3,2,40;36,2,40",1,"500,1000,1500",[[一場突然的大雨讓對峙雙方深陷泥沼，情報全部被迷霧阻擋，究竟該如何戰鬥……]],0,1,0,0,},
	[16] = {16,[[所羅門激戰]],[[2個所羅門激戰人偶]],[[我方所羅門激戰人偶防護力增加{0}%]],[[4個所羅門激戰人偶]],[[我方所羅門激戰人偶防護力增加{0}%]],[[5個所羅門激戰人偶]],[[我方所羅門激戰人偶防護力增加{0}%]],"fetters_icon_15","4,16,1","2,4,5","28,2,10;3,2,10|28,2,20;3,2,20|28,2,30;3,2,30",1,"500,1000,1500",[[那個夜晚，只有無盡的砲擊和燃燒的戰火……]],0,1,0,0,},
	[17] = {17,[[火雞狩獵]],[[2個火雞狩獵人偶]],[[我方火雞狩獵人偶暴擊增加{0}%]],[[4個火雞狩獵人偶]],[[我方火雞狩獵人偶暴擊增加{0}%]],[[5個火雞狩獵人偶]],[[我方火雞狩獵人偶暴擊增加{0}%]],"fetters_icon_16","4,17,1","2,4,5","9,2,10|9,2,20|9,2,30",1,"500,1000,1500",[[我警告你，可不要在神代會社的航母面前提火雞兩個字哦，什麼，是銀翼財團的人提的？那沒事了。]],0,1,0,0,},
	[999] = {999,[[深海]],'','','','','','','',"5,0,0","5","0,0,0|0,0,0|0,0,0",0,"0,0,0",'',0,2,0,0,},
}

function FettersConfig.GetConfig(key)
	local tb = FettersConfig.Values[key]
	if not tb then
		print_error(string.format("key type is %s,key = %s",type(key),key))
		return nil
	end
	local config = {["id"] = 1,["name"] = 2,["condition1"] = 3,["describe1"] = 4,["condition2"] = 5,["describe2"] = 6,["condition3"] = 7,["describe3"] = 8,["icon"] = 9,["fetterstype"] = 10,["parameter"] = 11,["attrtype"] = 12,["upgrade"] = 13,["expcoefficient"] = 14,["summary"] = 15,["groupid"] = 16,["onoff"] = 17,["fetterstips"] = 18,["nazo"] = 19,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return FettersConfig