local FettersRelationConfig = {}

FettersRelationConfig.Values = {
	[101] = {101,1,4,1,"1,1001,150|1,1002,250",[[,對薔薇帝國羈絆成員造成{0}%額外傷害]],[[,對薔薇帝國羈絆成員造成{0}%額外傷害]],'',0,},
	[102] = {102,2,1,1,"1,1001,150|1,1002,250",[[,對神代會社羈絆成員造成{0}%額外傷害]],[[,對神代會社羈絆成員造成{0}%額外傷害]],'',0,},
	[103] = {103,1,999,2,"28,2,30;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],'',0,},
	[104] = {104,3,2,1,"1,1001,150|1,1002,250",[[,對銀翼財團羈絆成員造成{0}%額外傷害]],[[,對銀翼財團羈絆成員造成{0}%額外傷害]],'',0,},
	[105] = {105,4,3,1,"1,1001,150|1,1002,250",[[,對黑鋒重工羈絆成員造成{0}%額外傷害]],[[,對黑鋒重工羈絆成員造成{0}%額外傷害]],'',0,},
	[106] = {106,2,999,2,"28,2,30;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],'',0,},
	[107] = {107,3,999,2,"28,2,30;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],'',0,},
	[108] = {108,4,999,2,"28,2,30;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],'',0,},
	[109] = {109,5,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[110] = {110,6,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[111] = {111,7,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[112] = {112,8,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[113] = {113,9,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[115] = {115,10,999,2,"28,2,30;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],'',0,},
	[116] = {116,11,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[117] = {117,12,999,2,"28,2,30;3,2,30",[[深海：全員防護力增加3%]],'','',0,},
	[118] = {118,13,999,2,"28,2,30;3,2,30",[[深海：全員防護力增加3%]],'','',0,},
	[119] = {119,14,999,2,"28,2,30;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],'',0,},
	[120] = {120,15,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[121] = {121,16,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
	[122] = {122,17,999,2,"28,2,30;3,2,30|28,2,60;3,2,30|28,2,60;3,2,30",[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],[[深海：全員防護力增加3%]],0,},
}

function FettersRelationConfig.GetConfig(key)
	local tb = FettersRelationConfig.Values[key]
	if not tb then
		print_error(string.format("key type is %s,key = %s",type(key),key))
		return nil
	end
	local config = {["id"] = 1,["id1"] = 2,["id2"] = 3,["fetters"] = 4,["relationattr"] = 5,["describe1"] = 6,["describe2"] = 7,["describe3"] = 8,["nazo"] = 9,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return FettersRelationConfig