local PushConfig = {}

PushConfig.Values = {
	[1] = {1,[[巡航]],1,[[人偶巡航已完成]],[[親愛的指揮官，巡航任務完成，人偶們已經回歸！]],0,1,0,},
	[2] = {2,[[人偶培養]],1,[[人偶培養已完成]],[[親愛的指揮官，人偶培養已完成，請前往黑潮基地驗收。]],0,1,0,},
	[3] = {3,[[裝備培養]],1,[[裝備製造已完成]],[[親愛的指揮官，裝備已製作完成，請前往黑潮基地驗收。]],0,1,0,},
	[4] = {4,[[7日登入提醒]],2,[[指揮官，我們需要你]],[[親愛的指揮官，你已經7天沒有回歸黑潮基地了,人偶們都非常想念你。]],7,1,0,},
	[5] = {5,[[15日登入提醒]],2,[[指揮官，我們需要你]],[[親愛的指揮官，你已經15天沒有回歸黑潮基地了,人偶們都非常想念你。]],15,1,0,},
	[6] = {6,[[海域開採]],1,[[海域開採資源已滿]],[[親愛的指揮官，海域開採的資源已經收集滿了，請盡快領取!]],0,1,0,},
	[7] = {7,[[利維坦深淵]],1,[[利維坦深淵可以挑戰了！]],[[親愛的指揮官，利維坦深淵可以再次挑戰了!]],0,1,0,},
	[8] = {8,[[時段登入]],1,[[記得上線領能源]],[[現在登入可以領取能源哦]],0,0,0,},
	[9] = {9,[[能源恢復]],1,[[能源已經完全恢復了]],[[能源已經完全恢復了可以戰鬥了]],0,0,0,},
}

function PushConfig.GetConfig(key)
	local tb = PushConfig.Values[key]
	if not tb then
		print_error(key)
		return nil
	end
	local config = {["id"] = 1,["name"] = 2,["pushtype"] = 3,["title"] = 4,["content"] = 5,["days"] = 6,["control"] = 7,["nazo"] = 8,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return PushConfig