local PushConfig = {
	[1] = {1,1,0,1,
		[[巡航]],
		[[人偶巡航已完成]],
		[[親愛的指揮官，巡航任務完成，人偶們已經回歸！]],
	},
	[2] = {2,1,0,1,
		[[人偶培養]],
		[[人偶培養已完成]],
		[[親愛的指揮官，人偶培養已完成，請前往黑潮基地驗收。]],
	},
	[3] = {3,1,0,1,
		[[裝備培養]],
		[[裝備製造已完成]],
		[[親愛的指揮官，裝備已製作完成，請前往黑潮基地驗收。]],
	},
	[4] = {4,2,7,1,
		[[7日登入提醒]],
		[[指揮官，我們需要你]],
		[[親愛的指揮官，你已經7天沒有回歸黑潮基地了,人偶們都非常想念你。]],
	},
	[5] = {5,2,15,1,
		[[15日登入提醒]],
		[[指揮官，我們需要你]],
		[[親愛的指揮官，你已經15天沒有回歸黑潮基地了,人偶們都非常想念你。]],
	},
	[6] = {6,1,0,1,
		[[海域開採]],
		[[海域開採資源已滿]],
		[[親愛的指揮官，海域開採的資源已經收集滿了，請盡快領取!]],
	},
	[7] = {7,1,0,1,
		[[利維坦深淵]],
		[[利維坦深淵可以挑戰了！]],
		[[親愛的指揮官，利維坦深淵可以再次挑戰了!]],
	},
	[8] = {8,1,0,0,
		[[時段登入]],
		[[記得上線領能源]],
		[[現在登入可以領取能源哦]],
	},
	[9] = {9,1,0,0,
		[[能源恢復]],
		[[能源已經完全恢復了]],
		[[能源已經完全恢復了可以戰鬥了]],
	},

}
function PushConfig.GetConfig(key)
	local Values = PushConfig[key]
	if not Values then
		print_error(key)
		return nil
	end
	local Fields = {["id"] = 1,["pushtype"] = 2,["days"] = 3,["control"] = 4,["name"] = 5,["title"] = 6,["content"] = 7,}
	for k,v in pairs(Fields) do
		Fields[k] = Values[v]
	end
	return Fields 
end
return PushConfig