local QuestionnaireConfig = {}

QuestionnaireConfig.Values = {
	[1] = {1,1,0,1,[[您的性別【單選題】]],[[男;女]],'',"20190801;20191201",0,},
	[2] = {2,1,0,2,[[您的年齡【單選題】]],[[13以下;14~19;20~25;26~35;36以上]],'',"20190801;20191201",0,},
	[3] = {3,1,1,3,[[選擇有玩過以下哪些遊戲（可多選）【多選題】]],[[艦隊collection;碧藍航線;戰艦少女R;深淵地平線;蒼藍誓約;少女前線;明日方舟;崩壞3rd;Fate/Grand Order;夢幻模擬戰;陰陽師;其他]],"0;0;0;0;0;0;0;0;0;0;0;1\n","20190801;20191201",0,},
	[4] = {4,1,0,4,[[您對作品中的角色立繪評價如何【單選題】(立繪畫風)]],[[5分（非常喜歡）;4分（喜歡）;3分;2分;1分]],'',"20190801;20191201",0,},
	[5] = {5,1,2,5,[[您最喜歡哪個角色的立繪【填空題】]],'','',"20190801;20191201",0,},
	[6] = {6,1,0,6,[[遊戲整體風格（UI風格、背景、色調、特效等）是否讓你接受【單選題】]],[[5分（非常喜歡）;4分（喜歡）;3分;2分;1分]],'',"20190801;20191201",0,},
	[7] = {7,1,0,7,[[您對目前的遊戲戰鬥看法如何【單選題】]],[[5分（非常喜歡）;4分（喜歡）;3分;2分;1分]],'',"20190801;20191201",0,},
	[8] = {8,1,0,8,[[你對於現在港口地圖玩法接受程度【單選題】]],[[5分;4分;3分;2分;1分]],'',"20190801;20191201",0,},
	[9] = {9,1,0,9,[[你對PVP玩法是否期待【單選題】]],[[5分;4分;3分;2分;1分]],'',"20190801;20191201",0,},
	[10] = {10,1,0,10,[[你對社交類活動是否接受【單選題】（需要好友協助、或可即時邀請好友一起打港口類的）]],[[5分;4分;3分;2分;1分]],'',"20190801;20191201",0,},
	[11] = {11,1,0,11,[[你是否期待豐富的聯盟玩法【單選題】（聯盟所指類似軍團、公會等）]],[[5分;4分;3分;2分;1分]],'',"20190801;20191201",0,},
	[12] = {12,1,0,12,[[你對後續正式戰鬥技能效果及技能動畫是否具有期待值【單選題】Ps：本次特效均非正式特效，技能動畫可參考 翔鶴 技能動畫]],[[5分（很期待）;4分;3分;2分;1分]],'',"20190801;20191201",0,},
	[13] = {13,1,0,13,[[您對本次關卡難度呈現感受如何？【單選題】]],[[太簡單了，完全沒有挑戰難度;有一定戰力需求，但是不用額外肝船攻略;難度提升太快，不肝過不去]],'',"20190801;20191201",0,},
	[14] = {14,1,0,14,[[您之後會將這個遊戲推薦給您的朋友體驗嗎？【單選題】]],[[會;不會;說不清楚]],'',"20190801;20191201",0,},
	[15] = {15,1,2,15,[[你對這次測試的建議回饋【填空題】]],'','',"20190801;20191201",0,},
	[16] = {16,2,0,1,[[你的性別【單選題】]],[[男;女]],'',"20191201;21201201",0,},
	[17] = {17,2,0,2,[[你的年齡【單選題】]],[[13以下;14～19;20～25;26～35;36以上]],'',"20191201;21201201",0,},
	[18] = {18,2,0,3,[[你是否經歷黑潮：深海覺醒玩法改版？]],[[是;否]],'',"20191201;21201201",0,},
	[19] = {19,2,0,4,[[你對作品中的角色立繪評價如何【單選題】（立繪畫風）]],[[5分（非常喜歡）;4分（喜歡）;3分;2分;1分]],'',"20191201;21201201",0,},
	[20] = {20,2,2,5,[[你最喜歡哪個角色的立繪【填空題】]],'','',"20191201;21201201",0,},
	[21] = {21,2,0,6,[[遊戲整體風格（UI風格、背景、色調、特效等）是否讓你接受【單選題】]],[[5分（非常喜歡）;4分（喜歡）;3分;2分;1分]],'',"20191201;21201201",0,},
	[22] = {22,2,0,7,[[您對目前的遊戲戰鬥看法如何【單選題】]],[[5分（非常喜歡）;4分（喜歡）;3分;2分;1分]],'',"20191201;21201201",0,},
	[23] = {23,2,0,8,[[你對於現在港口地圖玩法接受程度【單選題】]],[[5分;4分;3分;2分;1分]],'',"20191201;21201201",0,},
	[24] = {24,2,0,9,[[你覺得目前人偶定位是否清晰合理【單選題】]],[[5分;4分;3分;2分;1分（不清楚）]],'',"20191201;21201201",0,},
	[25] = {25,2,0,10,[[你覺得目前人偶深海化難度如何【單選題】]],[[5分（非常難）;4分;3分;2分;1分（非常簡單）]],'',"20191201;21201201",0,},
	[26] = {26,2,0,11,[[介面操作是否讓你接受【單選題】]],[[5分（實用）;4分;3分;2分;1分（難用）]],'',"20191201;21201201",0,},
	[27] = {27,2,0,12,[[您對本次關卡難度呈現感受如何？【單選題】]],[[太簡單了，完全沒有挑戰難度;有一定戰力需求，但是不用額外肝船攻略;難度提升太快，不肝過不去]],'',"20191201;21201201",0,},
	[28] = {28,2,0,13,[[您之後會將這個遊戲推薦給您的朋友體驗嗎？【單選題】]],[[會;不會;說不清楚]],'',"20191201;21201201",0,},
	[29] = {29,2,2,14,[[你對這次測試的建議回饋【填空題】]],'','',"20191201;21201201",0,},
}

function QuestionnaireConfig.GetConfig(key)
	local tb = QuestionnaireConfig.Values[key]
	if not tb then
		print_error(key)
		return nil
	end
	local config = {["id"] = 1,["groupid"] = 2,["type"] = 3,["no"] = 4,["title"] = 5,["options"] = 6,["blank"] = 7,["duration"] = 8,["nazo"] = 9,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return QuestionnaireConfig