local RechargeConfig = {}

RechargeConfig.Values = {
	[101] = {101,91,33,6,0,"item_1_iconitem_250024",0,0,[[新手招募禮包]],[[斯諾普特派補給，可獲得10張徵召合約]],"com.komoe.darkboomios.gp001","0","1,250077,1",1,'','',66,0,0,},
	[102] = {102,91,100,18,0,"item_1_iconitem_250028",0,0,[[新手初始禮包]],[[斯諾普特派補給，可獲得大量bp、經驗]],"com.komoe.darkboomios.gp002","0","1,250078,1",1,'','',200,0,0,},
	[103] = {103,91,190,40,0,"item_1_iconitem_250028",0,0,[[新手進階禮包]],[[斯諾普特派補給，可獲得A型人偶、突破材料]],"com.komoe.darkboomios.gp003","0","1,250079,1",1,'','',380,0,0,},
	[104] = {104,91,490,98,0,"item_1_iconitem_250028",0,0,[[新手高級禮包]],[[斯諾普特派補給，可獲得深海化相關材料]],"com.komoe.darkboomios.gp004","0","1,250080,1",1,'','',980,0,0,},
	[105] = {105,91,390,78,0,"item_1_iconitem_251001",0,0,[[高級深海限定禮包]],[[斯諾普特派補給，可獲得徵召合約、深海化材料]],"com.komoe.darkboomios.gp005","0","1,250081,1",1,'','',780,0,0,},
	[106] = {106,91,490,98,0,"item_1_iconitem_251001",0,0,[[改造限定禮包]],[[斯諾普特派補給，可獲得鑽石、強化材料]],"com.komoe.darkboomios.gp006","0","1,250082,1",1,'','',980,0,0,},
	[107] = {107,91,1690,328,0,"item_1_iconitem_251001",0,0,[[裝備限定禮包]],[[斯諾普特派補給，可獲得大量鑽石、稀有套裝、大量BP]],"com.komoe.darkboomios.gp007","0","1,250083,1",1,'','',3380,0,0,},
	[108] = {108,91,890,178,0,"item_1_iconitem_251001",0,0,[[高級技能限定禮包]],[[斯諾普特派補給，可獲得S型人偶、突破材料]],"com.komoe.darkboomios.gp008","0","1,250084,1",1,'','',1780,0,0,},
	[109] = {109,91,3290,648,0,"item_1_iconitem_251001",0,0,[[高級培養限定禮包]],[[斯諾普特派補給，可獲得大量提升實力材料]],"com.komoe.darkboomios.gp009","0","1,250085,1",1,'','',6580,0,0,},
	[110] = {110,91,1690,328,0,"item_1_iconitem_251001",0,0,[[SSR自選限定禮包]],[[斯諾普特派補給，可自選一位SSR人偶]],"com.komoe.darkboomios.gp010","0","1,250086,1",1,'','',3380,0,0,},
	[201] = {201,92,33,6,0,"item_1_iconitem_250024",0,0,[[新手招募禮包]],[[斯諾普特派補給，可獲得10張徵召合約]],"com.komoe.darkboomgp.gp001","0","1,250077,1",1,'','',66,0,0,},
	[202] = {202,92,100,18,0,"item_1_iconitem_250028",0,0,[[新手初始禮包]],[[斯諾普特派補給，可獲得大量bp、經驗]],"com.komoe.darkboomgp.gp002","0","1,250078,1",1,'','',200,0,0,},
	[203] = {203,92,190,40,0,"item_1_iconitem_250028",0,0,[[新手進階禮包]],[[斯諾普特派補給，可獲得A型人偶、突破材料]],"com.komoe.darkboomgp.gp003","0","1,250079,1",1,'','',380,0,0,},
	[204] = {204,92,490,98,0,"item_1_iconitem_250028",0,0,[[新手高級禮包]],[[斯諾普特派補給，可獲得深海化相關材料]],"com.komoe.darkboomgp.gp004","0","1,250080,1",1,'','',980,0,0,},
	[205] = {205,92,390,78,0,"item_1_iconitem_251001",0,0,[[高級深海限定禮包]],[[斯諾普特派補給，可獲得徵召合約、深海化材料]],"com.komoe.darkboomgp.gp005","0","1,250081,1",1,'','',780,0,0,},
	[206] = {206,92,490,98,0,"item_1_iconitem_251001",0,0,[[改造限定禮包]],[[斯諾普特派補給，可獲得鑽石、強化材料]],"com.komoe.darkboomgp.gp006","0","1,250082,1",1,'','',980,0,0,},
	[207] = {207,92,1690,328,0,"item_1_iconitem_251001",0,0,[[裝備限定禮包]],[[斯諾普特派補給，可獲得大量鑽石、稀有套裝、大量BP]],"com.komoe.darkboomgp.gp007","0","1,250083,1",1,'','',3380,0,0,},
	[208] = {208,92,890,178,0,"item_1_iconitem_251001",0,0,[[高級技能限定禮包]],[[斯諾普特派補給，可獲得S型人偶、突破材料]],"com.komoe.darkboomgp.gp008","0","1,250084,1",1,'','',1780,0,0,},
	[209] = {209,92,3290,648,0,"item_1_iconitem_251001",0,0,[[高級培養限定禮包]],[[斯諾普特派補給，可獲得大量提升實力材料]],"com.komoe.darkboomgp.gp009","0","1,250085,1",1,'','',6580,0,0,},
	[210] = {210,92,1690,328,0,"item_1_iconitem_251001",0,0,[[SSR自選限定禮包]],[[斯諾普特派補給，可自選一位SSR人偶]],"com.komoe.darkboomgp.gp010","0","1,250086,1",1,'','',3380,0,0,},
	[1007] = {1007,91,230,45,0,"trading_1_dia_icon_4",0,0,[[月度補給合同]],[[簽署月度合同獲得30天額外補給]],"com.komoe.darkboomios.item007","107","1,9,460",1,'','',460,0,0,},
	[2007] = {2007,92,230,45,0,"trading_1_dia_icon_4",0,0,[[月度補給合同]],[[簽署月度合同獲得30天額外補給]],"com.komoe.darkboomgp.item007","107","1,9,460",1,'','',460,0,0,},
	[1001] = {1001,91,33,6,66,"trading_1_dia_icon_1",66,0,[[獲取66黑鑽]],[[黑泥和礦物融合凝結而成，獲得極少量黑鑽]],"com.komoe.darkboomios.item001","101","1,9,66",1,"1,1,66",'',66,0,0,},
	[1002] = {1002,91,170,30,340,"trading_1_dia_icon_1",340,0,[[獲取340黑鑽]],[[黑泥和礦物融合凝結而成，獲得少量黑鑽]],"com.komoe.darkboomios.item002","102","1,9,340",1,"1,1,340",'',340,0,0,},
	[1003] = {1003,91,430,88,900,"trading_1_dia_icon_2",900,0,[[獲取900黑鑽]],[[黑泥和礦物融合凝結而成，獲得小份黑鑽]],"com.komoe.darkboomios.item003","103","1,9,900",1,"1,1,900",'',900,0,0,},
	[1004] = {1004,91,670,128,1460,"trading_1_dia_icon_2",1460,0,[[獲取1460黑鑽]],[[黑泥和礦物融合凝結而成，獲得大份黑鑽]],"com.komoe.darkboomios.item004","104","1,9,1460",1,"1,1,1460",'',1460,0,0,},
	[1005] = {1005,91,1690,328,3780,"trading_1_dia_icon_3",3780,0,[[獲取3780黑鑽]],[[黑泥和礦物融合凝結而成，獲得大量黑鑽]],"com.komoe.darkboomios.item005","105","1,9,3780",1,"1,1,3780",'',3780,0,0,},
	[1006] = {1006,91,3290,648,7530,"trading_1_dia_icon_4",7530,0,[[獲取7530黑鑽]],[[黑泥和礦物融合凝結而成，獲得超大量黑鑽]],"com.komoe.darkboomios.item006","106","1,9,7530",1,"1,1,7530",'',7530,0,0,},
	[2001] = {2001,92,33,6,66,"trading_1_dia_icon_1",66,0,[[獲取66黑鑽]],[[黑泥和礦物融合凝結而成，獲得極少量黑鑽]],"com.komoe.darkboomgp.item001","101","1,9,66",1,"1,1,66",'',66,0,0,},
	[2002] = {2002,92,170,30,340,"trading_1_dia_icon_1",340,0,[[獲取340黑鑽]],[[黑泥和礦物融合凝結而成，獲得少量黑鑽]],"com.komoe.darkboomgp.item002","102","1,9,340",1,"1,1,340",'',340,0,0,},
	[2003] = {2003,92,430,88,900,"trading_1_dia_icon_2",900,0,[[獲取900黑鑽]],[[黑泥和礦物融合凝結而成，獲得小份黑鑽]],"com.komoe.darkboomgp.item003","103","1,9,900",1,"1,1,900",'',900,0,0,},
	[2004] = {2004,92,670,128,1460,"trading_1_dia_icon_2",1460,0,[[獲取1460黑鑽]],[[黑泥和礦物融合凝結而成，獲得大份黑鑽]],"com.komoe.darkboomgp.item004","104","1,9,1460",1,"1,1,1460",'',1460,0,0,},
	[2005] = {2005,92,1690,328,3780,"trading_1_dia_icon_3",3780,0,[[獲取3780黑鑽]],[[黑泥和礦物融合凝結而成，獲得大量黑鑽]],"com.komoe.darkboomgp.item005","105","1,9,3780",1,"1,1,3780",'',3780,0,0,},
	[2006] = {2006,92,3290,648,7530,"trading_1_dia_icon_4",7530,0,[[獲取7530黑鑽]],[[黑泥和礦物融合凝結而成，獲得超大量黑鑽]],"com.komoe.darkboomgp.item006","106","1,9,7530",1,"1,1,7530",'',7530,0,0,},
	[10001] = {10001,91,30,6,70,"trading_1_dia_icon_1",70,0,[[獲取70黑鑽]],[[黑泥和礦物融合凝結而成，獲得極少量黑鑽]],"com.komoe.darkboommc.item001","0","1,9,70",1,'','',70,0,0,},
	[10002] = {10002,91,120,25,280,"trading_1_dia_icon_1",280,0,[[獲取280黑鑽]],[[黑泥和礦物融合凝結而成，獲得少量黑鑽]],"com.komoe.darkboommc.item002","0","1,9,280",1,'','',280,0,0,},
	[10003] = {10003,91,360,78,840,"trading_1_dia_icon_2",840,0,[[獲取840黑鑽]],[[黑泥和礦物融合凝結而成，獲得小份黑鑽]],"com.komoe.darkboommc.item003","0","1,9,840",1,'','',840,0,0,},
	[10004] = {10004,91,450,98,1050,"trading_1_dia_icon_2",1050,0,[[獲取1050黑鑽]],[[黑泥和礦物融合凝結而成，獲得大份黑鑽]],"com.komoe.darkboommc.item004","0","1,9,1050",1,'','',1050,0,0,},
	[10005] = {10005,91,720,158,1700,"trading_1_dia_icon_3",1700,0,[[獲取1700黑鑽]],[[黑泥和礦物融合凝結而成，獲得大份黑鑽]],"com.komoe.darkboommc.item005","0","1,9,1700",1,'','',1700,0,0,},
	[10006] = {10006,91,1190,258,2900,"trading_1_dia_icon_4",2900,0,[[獲取2900黑鑽]],[[黑泥和礦物融合凝結而成，獲得大量黑鑽]],"com.komoe.darkboommc.item006","0","1,9,2900",1,'','',2900,0,0,},
	[10007] = {10007,91,1490,328,3700,"trading_1_dia_icon_4",3700,0,[[獲取3700黑鑽]],[[黑泥和礦物融合凝結而成，獲得大量黑鑽]],"com.komoe.darkboommc.item007","0","1,9,3700",1,'','',3700,0,0,},
	[10008] = {10008,91,2390,518,6000,"trading_1_dia_icon_4",6000,0,[[獲取6000黑鑽]],[[黑泥和礦物融合凝結而成，獲得超大量黑鑽]],"com.komoe.darkboommc.item008","0","1,9,6000",1,'','',6000,0,0,},
	[10009] = {10009,91,2990,648,7700,"trading_1_dia_icon_4",7700,0,[[獲取7700黑鑽]],[[黑泥和礦物融合凝結而成，獲得超大量黑鑽]],"com.komoe.darkboommc.item009","0","1,9,7700",1,'','',7700,0,0,},
	[10010] = {10010,91,210,45,0,"trading_1_dia_icon_4",0,0,[[月度補給合同]],[[簽署月度合同獲得30天額外補給]],"com.komoe.darkboommc.item010","0","1,250013,1",1,'','',460,0,0,},
}

function RechargeConfig.GetConfig(key)
	local tb = RechargeConfig.Values[key]
	if not tb then
		print_error(key)
		return nil
	end
	local config = {["id"] = 1,["platformid"] = 2,["rmbqty"] = 3,["rmb"] = 4,["coinqty"] = 5,["icon"] = 6,["firstextra"] = 7,["extra"] = 8,["productname"] = 9,["description"] = 10,["productid"] = 11,["commodity"] = 12,["item"] = 13,["pay"] = 14,["firstgift"] = 15,["gift"] = 16,["paynum"] = 17,["backtype"] = 18,["nazo"] = 19,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return RechargeConfig