local UIHelpConfig = {}

UIHelpConfig.Values = {
	[2147483698001] = {500,50001,[[招募]],0,0,"2",0,},
	[8203387726361] = {1910,191001,[[聯盟]],1,1,"FleetFind",0,},
	[8160438052401] = {1900,190001,[[聯盟]],1,0,"6",0,},
	[3435973916801] = {800,80001,[[圖鑑]],0,0,"d",0,},
	[6012954354401] = {1400,140001,[[任務]],1,0,"9",0,},
	[7301444573201] = {1700,170001,[[成就]],1,0,"10",0,},
	[4299262363397] = {1001,100101,[[裝備選擇]],1,0,"EquipChoose",0,},
	[4307852298189] = {1003,100301,[[裝備強化]],1,0,"EquipEnhanced",0,},
	[42949673960001] = {10000,1000001,[[人偶提升]],0,0,[[人偶升級;人偶可以透過消耗賦絡溶液和BP進行升級。升級將整體提升人偶的戰鬥力。\n當人偶到達目前星級等級限制後，需要突破才能再次升級。]],0,},
	[42949673960002] = {10000,1000002,[[人偶提升]],0,0,[[人偶突破;所有人偶初始星數為<color=#64FFFF>1星</color>，可以透過消耗奈米神經元件和BP進行突破，突破後將提升人偶星數。\n突破可大幅提升人偶屬性值，提高人偶的<color=#64FFFF>等級限制</color>。到達最高星數後不可再進行突破。]],0,},
	[42949673960003] = {10000,1000003,[[人偶提升]],0,0,[[人偶裝備;人偶可透過裝備提升自身戰力，不同艦種的人偶可以配備的裝備有差異。\n裝備也可透過消耗其他裝備進行升級以提升屬性。\n在使用<color=#64FFFF>[自動更替]</color>後，系統將自動給人偶裝備符合該人偶艦種的最高屬性裝備。]],0,},
	[42949673960004] = {10000,1000004,[[人偶提升]],0,0,[[人偶技能;消耗BP以及<color=#64FFFF>同名人偶或同品質人偶素材</color>可解鎖或提升人偶技能。不同的技能等級的提升需要消耗的人偶數量不同。當人偶處於以下狀態時不可用於技能升級：<color=#64FFFF>鎖定中、秘書艦、後宅拜訪中、後宅房主、巡航中、演習防守中。</color>]],0,},
	[42953968927397] = {10001,1000101,[[人偶提升]],0,0,[[人偶升級;人偶可以透過消耗賦絡溶液和BP進行升級。升級將整體提升人偶的戰鬥力。\n當人偶到達目前星級等級限制後，需要突破才能再次升級。]],0,},
	[42953968927398] = {10001,1000102,[[人偶提升]],0,0,[[人偶突破;所有人偶初始星數為<color=#64FFFF>1星</color>，可以透過消耗奈米神經元件和BP進行突破，突破後將提升人偶星數。\n突破可大幅提高人偶屬性值，並提高人偶的<color=#64FFFF>等級限制</color>。到達最高星數後不可再進行突破。]],0,},
	[42953968927399] = {10001,1000103,[[人偶提升]],0,0,[[人偶裝備;人偶可透過裝備提升自身戰力，不同艦種的人偶可以配備的裝備有差異。\n裝備也可透過消耗其他裝備進行升級以提升屬性。\n在使用<color=#64FFFF>[自動更替]</color>後，系統將自動給人偶裝備符合該人偶艦種的最高屬性裝備。]],0,},
	[42953968927400] = {10001,1000104,[[人偶提升]],0,0,[[人偶技能;消耗BP以及<color=#64FFFF>同名人偶或同品質人偶素材</color>可解鎖或提升人偶技能。不同的技能等級的提升需要消耗的人偶數量不同。當人偶處於以下狀態時不可用於技能升級：<color=#64FFFF>鎖定中、秘書艦、後宅拜訪中、後宅房主、巡航中、演習防守中。</color>]],0,},
	[42958263894793] = {10002,1000201,[[人偶提升]],0,0,[[人偶升級;人偶可以透過消耗賦絡溶液和BP進行升級。升級將整體提升人偶的戰鬥力。\n當人偶到達目前星級等級限制後，需要突破才能再次升級。]],0,},
	[42958263894794] = {10002,1000202,[[人偶提升]],0,0,[[人偶突破;所有人偶初始星數為<color=#64FFFF>1星</color>，可以透過消耗奈米神經元件和BP進行突破，突破後將提升人偶星數。\n突破可大幅提高人偶屬性值，並提高人偶的<color=#64FFFF>等級限制</color>。到達最高星數後不可再進行突破。]],0,},
	[42958263894795] = {10002,1000203,[[人偶提升]],0,0,[[人偶裝備;人偶可透過裝備提升自身戰力，不同艦種的人偶可以配備的裝備有差異。\n裝備也可透過消耗其他裝備進行升級以提升屬性。\n在使用<color=#64FFFF>[自動更替]</color>後，系統將自動給人偶裝備符合該人偶艦種的最高屬性裝備。]],0,},
	[42958263894796] = {10002,1000204,[[人偶提升]],0,0,[[人偶技能;消耗BP以及<color=#64FFFF>同名人偶或同品質人偶素材</color>可解鎖或提升人偶技能。不同的技能等級的提升需要消耗的人偶數量不同。當人偶處於以下狀態時不可用於技能升級：<color=#64FFFF>鎖定中、秘書艦、後宅拜訪中、後宅房主、巡航中、演習防守中。</color>]],0,},
	[42962558862189] = {10003,1000301,[[人偶提升]],0,0,[[人偶升級;人偶可以透過消耗賦絡溶液和BP進行升級。升級將整體提升人偶的戰鬥力。\n當人偶到達目前星級等級限制後，需要突破才能再次升級。]],0,},
	[42962558862190] = {10003,1000302,[[人偶提升]],0,0,[[人偶突破;所有人偶初始星數為<color=#64FFFF>1星</color>，可以透過消耗奈米神經元件和BP進行突破，突破後將提升人偶星數。\n突破可大幅提高人偶屬性值，並提高人偶的<color=#64FFFF>等級限制</color>。到達最高星數後不可再進行突破。]],0,},
	[42962558862191] = {10003,1000303,[[人偶提升]],0,0,[[人偶裝備;人偶可透過裝備提升自身戰力，不同艦種的人偶可以配備的裝備有差異。\n裝備也可透過消耗其他裝備進行升級以提升屬性。\n在使用<color=#64FFFF>[自動更替]</color>後，系統將自動給人偶裝備符合該人偶艦種的最高屬性裝備。]],0,},
	[42962558862192] = {10003,1000304,[[人偶提升]],0,0,[[人偶技能;消耗BP以及<color=#64FFFF>同名人偶或同品質人偶素材</color>可解鎖或提升人偶技能。不同的技能等級的提升需要消耗的人偶數量不同。當人偶處於以下狀態時不可用於技能升級：<color=#64FFFF>鎖定中、秘書艦、後宅拜訪中、後宅房主、巡航中、演習防守中。</color>]],0,},
	[9878425010801] = {2300,230001,[[演習]],0,0,[[晉升規則;演習軍階共分為<color=#64FFFF>12級</color>，達到下一級軍階基礎積分將會晉升到下一軍階。\n到達最高軍階的上限分數後，將不再增加積分。]],0,},
	[9878425010802] = {2300,230002,[[演習]],0,0,[[賽季說明;賽季結束後將會重置軍階。\n所有軍階將在新賽季重置後統一<color=#64FFFF>下降兩級</color>。\n賽季重置後的軍階積分為所屬軍階的基礎積分。]],0,},
	[9878425010803] = {2300,230003,[[演習]],0,0,[[演習許可;每次演習將會消耗一張演習許可。演習許可透過<color=#64FFFF>商城購買</color>或<color=#64FFFF>自然恢復</color>方式獲得。\n演習許可的恢復上限為<color=#64FFFF>5張</color>，每恢復一張需要<color=#64FFFF>90分鐘</color>。]],0,},
	[9878425010804] = {2300,230004,[[演習]],0,0,[[次數刷新;每次<color=#64FFFF>演習勝利</color>後，將更換一批對手。\n每天的<color=#64FFFF>12點</color>和<color=#64FFFF>18點</color>，將自動更換一批對手。手動更換對手的次數將在次日<color=#64FFFF>4點</color>重置。]],0,},
	[22119082089401] = {5150,515001,[[後宅]],0,0,[[後宅宿舍;隨著指揮官等級的不斷提升，可以在後宅中控臺內解鎖更多的後宅房間。\n每一間後宅房間都可進行各具特色的家具佈置，佈置更多家具的同時可以提升房間的<color=#64FFFF>舒適度</color>等級，從而使房主和前來拜訪的人偶獲得更多的<color=#64FFFF>心情值</color>恢復。\n每一間後宅房間在中控臺內設置房主後，房主每日都可以邀請一次其餘人偶前來拜訪，至多可邀請<color=#64FFFF>4名</color>人偶，單次拜訪持續<color=#64FFFF>4小時</color>。\n拜訪過程中，房主和前來拜訪的人偶均可獲得<color=#64FFFF>心情值</color>恢復，且在拜訪完成時獲得人偶經驗獎勵。]],0,},
	[22119082089402] = {5150,515002,[[後宅]],0,0,[[裝備製作;指揮官可透過製作室內的製作總控台設備進行裝備製作，下達訂單時可以篩選排除指揮官不需要的裝備類型，且製作出的裝備均為罕見及以上品質。\n隨著指揮官在世界地圖的港口佔領進度提升，可花費時間和BP對<color=#64FFFF>3D印表機</color>進行升級改造，從而減少裝備製作的時間。\n隨著指揮官在世界地圖的港口佔領進度提升，可花費時間和BP對<color=#64FFFF>工程圖紙桌</color>進行升級改造，從而增加可篩選排序的裝備類型數量。\n隨著指揮官在世界地圖的港口佔領進度提升，可花費時間和BP對<color=#64FFFF>裝備收納箱</color>進行升級改造，從而增加裝備製造訂單的數量上限。]],0,},
	[1717986958401] = {400,40001,[[世界地圖]],0,0,[[海域開採;港口由<color=#64FFFF>核心港口</color>和<color=#64FFFF>周邊港口</color>兩部分組成。每個港口都可以給玩家提供即時產出的資源。\n核心港口駐紮人偶後，會進行海域開採（開採核心港口以及隸屬於他的周邊港口），資源最多累計<color=#64FFFF>12小時</color>。\n駐紮在核心港口的人偶會提供額外的開採資源，自身也會獲得經驗值（在離開駐紮時，該人偶直接獲得駐紮的經驗）]],0,},
	[1717986958402] = {400,40002,[[世界地圖]],0,0,[[勢力反攻;佔領港口後，敵方有一定機率會對指揮官佔領的<color=#64FFFF>核心</color>港口發動反攻。\n指揮官可透過對核心港口進行人偶<color=#64FFFF>駐紮</color>，以抵禦可能出現的反攻。\n當反攻出現時，將會對指揮官進行<color=#64FFFF>預警</color>。在預警時間結束後，反攻的敵軍會與港口部隊發生戰鬥。\n<color=#64FFFF>防守成功</color>時，指揮官將會獲得防守獎勵。\n<color=#64FFFF>防守失敗</color>時，指揮官將失去該港口的控制權。無法再在該港口進行打撈，海域開採會停止。\n指揮官可以奪回被反攻佔領的港口，奪取港口後可以重新進行打撈，駐紮人偶，進行海域開採。]],0,},
	[1717986958403] = {400,40003,[[世界地圖]],0,0,[[地圖巡航;在指揮官控制的核心港口中，會出現巡航任務。\n指揮官可指派人偶進行巡航任務，在滿足巡航任務的<color=#64FFFF>條件</color>後，將開始任務。\n巡航任務開始後，需要經過一段時間任務才會完成並出現獎勵。\n指揮官可以在巡航任務進行途中<color=#64FFFF>取消</color>任務，但不可獲得任務獎勵。取消後指揮官可以重新開始任務。]],0,},
	[8332236748241] = {1940,194001,[[聯盟任務]],0,0,[[聯盟任務<color=#64FFFF>每週一4點</color>重置。\n聯盟任務分為<color=#64FFFF>聯盟懸賞</color>和<color=#64FFFF>貢獻獎勵</color>。\n全聯盟成員共用聯盟懸賞任務進度。\n貢獻值為個人行為單獨獲得，每個懸賞行為達到一定標準後都可獲得貢獻值。\n達到一定貢獻值後可在<color=#64FFFF>[貢獻獎勵]</color>處領取豐富獎勵。]],0,},
	[10350871424361] = {2410,241001,[[深海實驗]],0,0,[[對人偶進行深海實驗能夠完成人偶的<color=#64FFFF>深海化</color>改造。\n深海化是人偶完成人格覺醒的過程。深海化之後，人偶的形象及性格都會發生改變。\n人偶在完成深海化改造後，屬性將會獲得大幅度提升，羈絆效果也會有相應加成。]],0,},
	[10393821098321] = {2420,242001,[[艦裝改造]],0,0,[[艦裝改造是一種僅針對於<color=#64FFFF>深海化後</color>的人偶的高階改造。\n透過消耗bp和皮米材料可對人偶進行艦裝升級，以提升人偶的固定屬性。\n消耗深海尖晶進行升星可為人偶增加裝備屬性的加成。最高升到<color=#64FFFF>5星</color>。\n艦裝改造的<color=#64FFFF>5個</color>槽位對應人偶的<color=#64FFFF>5個</color>裝備槽位。艦裝改造賦予的裝備屬性加成既是對人偶穿戴的對應裝備的屬性加成。]],0,},
	[2065879317477] = {481,48101,[[深海閃擊]],0,0,[[副本說明;深海閃擊的敵人將比一般港口的敵人更加難以對付。\n當指揮官消耗能源挑戰深海閃擊並成功後，將會獲得大量<color=#64FFFF>深海化材料</color>。\n不同的閃擊副本，根據所在<color=#64FFFF>勢力區域</color>的不同，可以獲得深海化材料也會不同。]],0,},
	[2065879317478] = {481,48102,[[深海閃擊]],0,0,[[狀態共用;世界地圖內四大洲所有閃擊作戰的我方艦隊人偶狀態<color=#64FFFF>(血量、心情等)</color>均共用。\n每次閃擊作戰後，敵我雙方艦隊中的人偶均會保留戰鬥結束時的狀態。\n一旦艦隊中的人偶在閃擊中破損，那當日該人偶將不可再次進行閃擊作戰。\n所有閃擊艦隊的人偶將於<color=#64FFFF>每日4點</color>進行維修，所有狀態重置刷新。]],0,},
	[22638773144317] = {5271,527101,[[羈絆]],0,0,[[人偶羈絆;不同人偶的組合可以形成羈絆效果，羈絆效果能夠賦予編隊中的人偶<color=#64FFFF>額外屬性</color>。\n每種羈絆效果分為多個檔位，同一種羈絆效果只會生效已觸發的最高檔位。\n若滿編編隊中的所有人偶都已經完成<color=#64FFFF>深海化</color>改造，則會獲得額外的屬性加成。]],0,},
	[22638773144318] = {5271,527102,[[羈絆]],0,0,[[羈絆加成;部分羈絆效果會和其他部分羈絆效果形成<color=#64FFFF>剋制關係</color>。剋制關係生效時，會對被剋制方造成額外傷害。\n戰鬥結算時，已生效的羈絆效果會獲得羈絆經驗以提升羈絆等級。羈絆屬性的加成會根據等級進行提升。\n只有在需要<color=#64FFFF>消耗能源</color>的關卡，才能獲得羈絆經驗。]],0,},
	[2383706904781] = {555,55501,[[人偶回收]],0,0,[[回收人偶會返還指揮官<color=#64FFFF>能源</color>以及<color=#64FFFF>回收券</color>，回收券可以在回收商店中兌換獎勵。\n人偶一旦被回收將<color=#64FFFF>無法復原</color>。被回收的人偶所配備的裝備也可直接出售換取BP。]],0,},
	[2534030763641] = {590,59001,[[人偶培養]],0,0,[[消耗<color=#64FFFF>催化合劑</color>可培養人偶，經過一段時間的培養後可以得到人偶。\n消耗的催化合劑越多，培養出高品質人偶的機率就越高最多消耗<color=#64FFFF>10個</color>催化合劑。\n消耗<color=#64FFFF>超頻防熔斷阻尼器</color>可加速培養速度，立即獲得培養所得的人偶。]],0,},
}

function UIHelpConfig.GetConfig(key)
	local tb = UIHelpConfig.Values[key]
	if not tb then
		print_error(key)
		return nil
	end
	local config = {["id"] = 1,["titleid"] = 2,["name"] = 3,["mode"] = 4,["guide"] = 5,["words"] = 6,["nazo"] = 7,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return UIHelpConfig