local WorldStoryHarbourConfig = {}

WorldStoryHarbourConfig.Values = {
	[200101] = {200101,1001,[[出逃-第一幕]],{4,0,0,0,1},0,},
	[200102] = {200102,1002,[[神秘人偶-第一幕]],{4,0,0,0,1},0,},
	[200103] = {200103,1002,[[神秘人偶-第二幕]],{4,0,0,0,1},0,},
	[200104] = {200104,1002,[[神秘人偶-第三幕]],{4,0,0,0,1},0,},
	[200105] = {200105,1003,[[漁村之夜-第一幕]],{4,0,0,0,1},0,},
	[200201] = {200201,1003,[[漁村之夜-第二幕]],{4,0,0,0,1},0,},
	[200202] = {200202,1003,[[漁村之夜-第三幕]],{4,0,0,0,1},0,},
	[200203] = {200203,1003,[[漁村之夜-第四幕]],{4,0,0,0,1},0,},
	[200204] = {200204,1004,[[騷亂-第一幕]],{4,0,0,0,1},0,},
	[200205] = {200205,1004,[[騷亂-第二幕]],{4,0,0,0,1},0,},
	[200206] = {200206,1004,[[騷亂-第三幕]],{4,0,0,0,1},0,},
	[200207] = {200207,1004,[[騷亂-第四幕]],{4,0,0,0,1},0,},
	[200301] = {200301,1005,[[八百萬神-第一幕]],{4,0,0,0,1},0,},
	[200302] = {200302,1005,[[八百萬神-第二幕]],{4,0,0,0,1},0,},
	[200303] = {200303,1005,[[八百萬神-第三幕]],{4,0,0,0,1},0,},
	[200304] = {200304,1005,[[八百萬神-第四幕]],{4,0,0,0,1},0,},
	[200305] = {200305,1005,[[八百萬神-第五幕]],{4,0,0,0,1},0,},
}

function WorldStoryHarbourConfig.GetConfig(key)
	local tb = WorldStoryHarbourConfig.Values[key]
	if not tb then
		print_error(key)
		return nil
	end
	local config = {["harbourid"] = 1,["partid"] = 2,["shortname"] = 3,["recommendboat"] = 4,["nazo"] = 5,}
	for k,v in pairs(config) do
		config[k] = tb[v]
	end
	return config 
end
return WorldStoryHarbourConfig